little_angels_playhouse_api/app/controllers/classrooms_controller.rb

  def index
    @classrooms = Classroom.all
---
SELECT "classrooms".* FROM "classrooms"

  def show
    @classroom = Classroom.find(params[:id])
---
SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @classroom = Classroom.new(classroom_params)
    if @classroom.save
---
INSERT INTO "classrooms" ("address", "monthly_fee", "sqft", "class_size", "provide_meals", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @classroom = Classroom.find(params[:id])
    if @classroom.update(classroom_params)
---
SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "classrooms" SET "address" = $1, "updated_at" = $2 WHERE "classrooms"."id" = $3  [["address", "25 Stern Lane, Copiague, NY"], ["updated_at", "2018-09-06 15:44:10.330117"], ["id", 1]]

  def destroy
    classroom = Classroom.find(params[:id])
    if classroom.destroy
---
SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "classrooms" WHERE "classrooms"."id" = $1  [["id", 9]]