little_angels_playhouse_api/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "age", "class_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Andrew"], ["last_name", "John"], ["age", 1], ["class_id", 1], ["created_at", "2018-09-06 15:37:12.512013"], ["updated_at", "2018-09-06 15:37:12.512013"]]

  def update
    @student = Student.find(params[:id])
    if @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = $1, "last_name" = $2, "age" = $3, "class_id" = $4, "updated_at" = $5 WHERE "students"."id" = $6  [["first_name", "P"], ["last_name", ""], ["age", 3], ["class_id", 2], ["updated_at", "2018-09-10 15:19:00.725162"], ["id", 8]]

  def destroy
    student = Student.find(params[:id])
    if student.destroy
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 3]]